## Plan Result (prod_dynatrace_activegate)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Replace
  * azurerm_role_assignment.virtual_machine_admin
  * azurerm_role_assignment.virtual_machine_user




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.virtual_machine_admin must be replaced
-/+ resource "azurerm_role_assignment" "virtual_machine_admin" {
      ~ id                               = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/dynatrace-activegate-prod/providers/Microsoft.Authorization/roleAssignments/ee15fc7a-8533-f048-deb8-1f9a8c7ebaee" -> (known after apply)
      ~ name                             = "ee15fc7a-8533-f048-deb8-1f9a8c7ebaee" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> "/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" # forces replacement
      ~ role_definition_name             = "Virtual Machine Administrator Login" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.virtual_machine_user must be replaced
-/+ resource "azurerm_role_assignment" "virtual_machine_user" {
      ~ id                               = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/dynatrace-activegate-prod/providers/Microsoft.Authorization/roleAssignments/db662436-90de-0a7c-d449-de53dff63120" -> (known after apply)
      ~ name                             = "db662436-90de-0a7c-d449-de53dff63120" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/providers/Microsoft.Authorization/roleDefinitions/fb879df8-f326-4884-b1cf-06f3ad86be52" -> "/providers/Microsoft.Authorization/roleDefinitions/fb879df8-f326-4884-b1cf-06f3ad86be52" # forces replacement
      ~ role_definition_name             = "Virtual Machine User Login" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":14,"Program":"tfcmt","SHA1":"","Target":"prod_dynatrace_activegate","Vars":{}} -->